class Machine:
    def __init__(self, x_speed, y_speed):
        ###############################
        
        pass
        
        ###############################
        
    
    def move_to(self, x_pos, y_pos):
        ###############################
        
        pass
        
        ###############################
    
    
    def move_time(self, x_pos, y_pos):
        ###############################
        
        pass
        
        ###############################

    
    def move_to_init(self):
        ###############################
        
        pass
        
        ###############################
    
    
    def __str__(self):
        ###############################
        
        pass
        
        ###############################

    

class Rack:
    def __init__(self, x_size, y_size):
        # 상품이 없는 위치는 "X"로 표시
        ###############################
        
        pass
        
        ###############################
    
    
    def __str__(self):
        ###############################
        
        pass
        
        ###############################



if __name__ == '__main__':
    r = Rack(2, 2)
    print(r)

    m = Machine(2, 3)
    print(m)
    print(m.move_time(1, 2))